Tekla.Structures.Drawing.LayoutAttributes
The LayoutAttributes class contains attributes for controlling the drawing layout.
Tekla.Structures.Drawing.Drawing

Tekla.Structures.Drawing.LayoutAttributes.ListHiddenObjectsInTemplates
Gets or sets the property for controlling whether to list hidden objects in templates.

Tekla.Structures.Drawing.LayoutAttributes.AutoSizeOptions
Gets or sets the auto size options that control the drawing sheet
size. Setting this property will change the SizeDefinitionMode to AutoSize.
Deprecated since TS2020. Always returns AutoSizeOptions.FixedSizes

Tekla.Structures.Drawing.LayoutAttributes.SheetSize
Gets or sets the sheet size. Setting this property will change the
SizeDefinitionMode to SpecifiedSize.

Tekla.Structures.Drawing.LayoutAttributes.SizeDefinitionMode
Gets or sets the size definition mode.

Tekla.Structures.Drawing.LayoutAttributes.InternalLayout
Gets or sets the property for which layout to use.
NOTE! Both Layout and TableLayoutId are marked as internal for now, we get the values loaded correctly through LoadAttributes, however
there are some serious issues with the transporting of an id here and in core. We need to do some more refactoring to reveal the layouts correctly for the users.

Tekla.Structures.Drawing.LayoutAttributes.InternalTableLayoutId
Gets or sets the property for which table layout id to use.
NOTE! Both Layout and TableLayoutId are marked as internal for now, we get the values loaded correctly through LoadAttributes, however
there are some serious issues with the transporting of an id here and in core. We need to do some more refactoring to reveal the layouts correctly for the users.

Tekla.Structures.Drawing.LayoutAttributes.#ctor(System.String,Tekla.Structures.Drawing.DrawingType)
Creates a new layout attributes instance that loads standard attributes.
AttributeFile: The name of the drawing attribute file. E.g. "standard".
drawingType: The type of drawing to load layout attributes for.

Tekla.Structures.Drawing.LayoutAttributes.#ctor(System.Boolean,Tekla.Structures.Drawing.DrawingType)
Creates a new layout attributes instance that loads standard attributes if LoadAttributes is true.
LoadAttributes: Whether to load the attributes.
drawingType: The type of drawing to load layout attributes for.
Remarks: AttributesBase will call LoadAttributes before the drawing type is set, so explictly pass true for SkipLoadingAttributes parameter.

Tekla.Structures.Drawing.LayoutAttributes.#ctor(System.String)
Creates a new layout attributes instance that loads drawing layout attributes from the specified attribute file.
AttributeFile: The name of the drawing attribute file. E.g. "standard".

Tekla.Structures.Drawing.LayoutAttributes.#ctor
Creates a new layout attributes instance that loads standard attributes.

Tekla.Structures.Drawing.LayoutAttributes.#ctor(System.String,Tekla.Structures.Drawing.Drawing)
Creates a new layout attributes instance that loads drawing layout attributes from the specified attribute file.
AttributeFile: The name of the drawing attribute file. E.g. "standard".
Drawing: The type of drawing to load layout attributes for.

Tekla.Structures.Drawing.LayoutAttributes.#ctor(Tekla.Structures.Drawing.Drawing)
Creates a new layout attributes instance that loads standard attributes.
Drawing: The type of drawing to load layout attributes for.

Tekla.Structures.Drawing.LayoutAttributes.LoadAttributes(System.String)
Loads drawing layout attributes from the specified attribute file.
AttributeFile: The name of the drawing attribute file. E.g. "standard".
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.LayoutAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.